# LineTooShortWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveFailures..::..LineTooShortWarning Property
BuiltInFailures..::..CurveFailures Class See Also
---
Line is too short.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LineTooShortWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LineTooShortWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LineTooShortWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurveFailures Class
Autodesk.Revit.DB Namespace